CREATE TABLE phrases_views
(
    dt          DateTime,
    campaign_id Int32 comment 'Идентификатор рекламной кампании',
    phrase      String comment 'Поисковой запрос',
    views       Int32 comment 'Кумулятивное (суммарное) количество просмотров по поисковому запросу за всё время'
) engine = ReplacingMergeTree ORDER BY (dt, campaign_id, phrase);

INSERT INTO phrases_views (dt, campaign_id, phrase, views)
VALUES ('2025-01-01 11:50:00', 1111111, 'платье', 100),
       ('2025-01-01 12:00:00', 1111111, 'платье', 100),
       ('2025-01-01 12:10:00', 1111111, 'платье', 100),
       ('2025-01-01 12:20:00', 1111111, 'платье', 100),
       ('2025-01-01 12:30:00', 1111111, 'платье', 100),
       ('2025-01-01 12:40:00', 1111111, 'платье', 101),
       ('2025-01-01 12:50:00', 1111111, 'платье', 101),
       ('2025-01-01 13:00:00', 1111111, 'платье', 101),
       ('2025-01-01 13:10:00', 1111111, 'платье', 101),
       ('2025-01-01 13:20:00', 1111111, 'платье', 101),
       ('2025-01-01 13:30:00', 1111111, 'платье', 102),
       ('2025-01-01 13:40:00', 1111111, 'платье', 103),
       ('2025-01-01 13:50:00', 1111111, 'платье', 105),
       ('2025-01-01 14:00:00', 1111111, 'платье', 105),
       ('2025-01-01 14:10:00', 1111111, 'платье', 106),
       ('2025-01-01 14:20:00', 1111111, 'платье', 108),
       ('2025-01-01 14:30:00', 1111111, 'платье', 109),
       ('2025-01-01 14:40:00', 1111111, 'платье', 110),
       ('2025-01-01 14:50:00', 1111111, 'платье', 111),
       ('2025-01-01 15:00:00', 1111111, 'платье', 111),
       ('2025-01-01 15:10:00', 1111111, 'платье', 111),
       ('2025-01-01 15:20:00', 1111111, 'платье', 112),
       ('2025-01-01 15:30:00', 1111111, 'платье', 113),
       ('2025-01-01 15:40:00', 1111111, 'платье', 113),
       ('2025-01-01 15:50:00', 1111111, 'платье', 115),
       ('2025-01-01 16:00:00', 1111111, 'платье', 115);